using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace StringManipulation.Classes
{
    public static class TaskLabels
    {
        public static string Task1 => "Задача 1\nВ заданной строке перед каждой большой латинской буквой поставить \" \" (точка, пробел).";
        public static string Task2 => "Задача 2\nРазрядить пробелами заданную строку.";
        public static string Task3 => "Задача 3\nВ заданной строке заменить сочетание символов \"-+\" симолом \"0\"";
        public static string Task4 => "Задача 4\nВ заданной строке заменить каждый символ строки следующим по коду симолом. Букву \"я\" заменить пробелом.";
        public static string Task5 => "Задача 5\nВ заданной строке поменять каждый символ строки предыдущим по таблице кодирования символом.";
        public static string Task6 => "Задача 6\nВ заданной строке после каждого символа вставить число, соответствующее коду этого символа.";
        public static string Task7 => "Задача 7\nПолучить из заданной строки две строки, состоящие из символов первой строки, имеющих соответственно четные и нечетные индексы.";
        public static string Task8 => "Задача 8\nЗаданы две строки одинаковой длины. Построить новую строку, состояющую из символов как одной, так и другой строки, чередующихся между собой.";
        public static string Task9 => "Задача 9\nВ строке после каждого слова дописать ее длину.";
        public static string Task10 => "Задача 10\nЗадана строка. Получить предпоследнее слово этой строки. Разделителем слов считаются один или несколько пробелов.";
        public static string Task11 => "Задача 11\nВ заданной строке заменить четное количество подряд идущих пробелов символом \"Ч\", а нечетное - символом \"Н\".";
        public static string Task12 => "Задача 12\nДля заданной строки после каждой русской буквы поставить ее код, а после каждой латинской - символ \"\".";
        public static string Task13 => "Задача 13\nВ заданной строке, после каждого слова вида \"sin\", \"cos\" или \"log\", поставить скобку \"(\".";
    }
}
